RobertATU/LoRaWAN-Lamb-Link-Next/CustomUC/Src/stm32wl_modem.c
/**
  ******************************************************************************
  * @file    stm32wl_modem.c
  * @author  SRA Team
  * @version V1.0.0
  * @brief   This file provides set of driver functions to manage communication
  *          between BSP and STM32WL LoRa modem.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/** @addtogroup ASTRA_BSP_MODEM
  * @{
  */

/* Includes ------------------------------------------------------------------*/

#include "stm32wl_modem.h"

#define in_range(c, lo, up)    ((uint8_t)c >= lo && (uint8_t)c <= up)                                          //!< in_range UTILITY
#define isdigit(c)             in_range(c, '0', '9')                                                           //!< isdigit UTILITY
#define digit(c)               (c - '0')                                                                       //!< digit UTILITY
#define xdigit(c)              isdigit(c)?digit(c):in_range(c, 'a', 'f')?(10+c-'a'):in_range(c, 'A', 'F')?(10+c-'A'):0                 //!< xdigit UTILITY
#define isxdigit(c)            (isdigit(c) || in_range(c, 'a', 'f') || in_range(c, 'A', 'F'))                  //!< isxdigit UTILITY

#ifndef   __WEAK
  #define __WEAK                                 __attribute__((weak))
#endif

#define PTR_BUFFER_LEN  128
#define PRINTF_0(...)
#define PRINTF_1(...)

/** @addtogroup STM32WL_MODEM_Private_Variables STM32WL modem - Private variables
  * @brief Private variables
  * @{
  */

/* Private variables  --------------------------------------------------------*/

uint8_t wlbuf[WL_RX_BUFFER_LEN+1];
uint8_t ptr[PTR_BUFFER_LEN+1];

STM32WL_MODEM_CommonDrv_t STM32WL_MODEM_COMMON_Driver =
{
  .Init                 = STM32WL_MODEM_Init,
  .DeInit               = STM32WL_MODEM_DeInit,
  .GetCapabilities      = STM32WL_MODEM_GetCapabilities,
};

STM32WL_MODEM_FuncDrv_t STM32WL_MODEM_LORA_Driver =
{
  .Enable               = STM32WL_MODEM_Enable,
  .Disable              = STM32WL_MODEM_Disable,
  .HwReset              = STM32WL_MODEM_HwReset,
  .Ping                 = STM32WL_MODEM_Ping,
  .ManageURCs           = STM32WL_MODEM_ManageURCs,
  .SendBinPacket        = STM32WL_MODEM_SendBinPacket,
  .GetVersion           = STM32WL_MODEM_GetVersion,
  .GetDeviceEUI         = STM32WL_MODEM_GetDeviceEUI,
  .GetAppEUI            = STM32WL_MODEM_GetAppEUI,
  .GetAppKEY            = STM32WL_MODEM_GetAppKEY,
  .GetNwkKEY            = STM32WL_MODEM_GetNwkKEY,
  .SetAppEUI            = STM32WL_MODEM_SetAppEUI,
  .SetAppKEY            = STM32WL_MODEM_SetAppKEY,
  .SetNwkKEY            = STM32WL_MODEM_SetNwkKEY,

  .GetDADD              = STM32WL_MODEM_GetDADD,
  .GetAppSKEY           = STM32WL_MODEM_GetAppSKEY,
  .GetNwkSKEY           = STM32WL_MODEM_GetNwkSKEY,
  .SetDADD              = STM32WL_MODEM_SetDADD,
  .SetAppSKEY           = STM32WL_MODEM_SetAppSKEY,
  .SetNwkSKEY           = STM32WL_MODEM_SetNwkSKEY,


  .GetDataRate          = STM32WL_MODEM_GetDataRate,
  .SetRegionBandID      = STM32WL_MODEM_SetRegionBandID,
  .Join_OTAA            = STM32WL_MODEM_Join_OTAA,
  .Join_ABP             = STM32WL_MODEM_Join_ABP,
  .SetAdaptiveDataRate  = STM32WL_MODEM_SetAdaptiveDataRate,
  .SetDataRate          = STM32WL_MODEM_SetDataRate,
  .WL_LowPower          = STM32WL_MODEM_WL_LowPower,
  .WL_RebootDfu         = STM32WL_MODEM_WL_RebootDfu,
};

/**
* @} STM32WL_MODEM_Private_Variables
*/

/** @addtogroup STM32WL_MODEM_Private_Types STM32WL modem - Private types
  * @brief Private types
  * @{
  */

/* Exported types ------------------------------------------------------------*/

typedef enum
{
  AT_CTRL = 0,
  AT_SET,
  AT_GET,
  AT_TEST,
}AT_cmd_type_t;

typedef enum
{
  AT_OK,
  AT_ERROR
}AT_resp_code_t;

typedef enum //see AT_cmd_strings; take care about the order
{
  AT_AT,
  AT_RESET,
  AT_JOIN,
  AT_NJS,
  AT_DEUI,
  AT_DADDR,
  AT_APPKEY,
  AT_NWKKEY,
  AT_NWKSKEY,
  AT_APPSKEY,
  AT_APPEUI,
  AT_SENDB,
  AT_BAND,
  AT_ADR,
  AT_DR,
  AT_VER,
  AT_CUST_LP,
  AT_CUST_DFU,
}AT_cmd_code_t;

typedef struct ATcommands_s
{
  AT_cmd_code_t code;
  char *cmdstring;
}ATcommands_t;

ATcommands_t AT_cmd_strings[] = {
  { AT_AT,        ""},             /* ATention command */
  { AT_RESET,     "Z"},            /* Reset command */
  { AT_JOIN,      "+JOIN"},        /* +JOIN */
  { AT_NJS,       "+NJS"},         /* +NJS */
  { AT_DEUI,      "+DEUI"},        /* +DEUI device ID */
  { AT_DADDR,     "+DADDR"},       /* +DADDR device Address */
  { AT_APPKEY,    "+APPKEY"},      /* +APPKEY application key */
  { AT_NWKKEY,    "+NWKKEY"},      /* +NWKKEY application key */
  { AT_NWKSKEY,   "+NWKSKEY"},     /* +NWKSKEY Network session Key */
  { AT_APPSKEY,   "+APPSKEY"},     /* +APPSKEY application Session key */
  { AT_APPEUI,    "+APPEUI"},      /* +APPEUI application Identifier */
  { AT_SENDB,     "+SENDB"},       /* +SENDB send data binary format */
  { AT_BAND,      "+BAND"},        /* +BAND Active Region BandID=[0:AS923, 1:AU915, 2:CN470, 3:CN779, 4:EU433, 5:EU868, 6:KR920, 7:IN865, 8:US915, 9:RU864]*/
  { AT_ADR,       "+ADR"},         /* +ADR adaptive data rate  */
  { AT_DR,        "+DR"},          /* +DR data rate */
  { AT_VER,       "+VER"},         /* +VER firmware version */
  { AT_CUST_LP,   "+CUST_LP"},     /* Put WL in low power */
  { AT_CUST_DFU,  "+CUST_DFU"},    /* Put WL in uart programming */
};

/**
* @} STM32WL_MODEM_Private_Types
*/

/** @addtogroup STM32WL_MODEM_Private_FunctionPrototypes STM32WL modem - Private function prototypes
  * @brief Private function prototypes
  * @{
  */

/* Private function prototypes -----------------------------------------------*/

/**
 * @brief  AT manage
 * @param  pObj: Pointer to STM32WL_MODEM_Object_t
 * @param  cmd_type: Command type AT_cmd_type_t
 * @param  cmd_code: Command code AT_cmd_code_t
 * @param  pInOutData: Pointer to void
 * @param  nDataLen: 32bit unsigned integer length
 * @retval AT_OK if success, otherwise AT_ERROR
 */
AT_resp_code_t AtManage(STM32WL_MODEM_Object_t *pObj, AT_cmd_type_t cmd_type, AT_cmd_code_t cmd_code, void *pInOutData, uint32_t nDataLen);

/**
 * @brief  AT manage empty
 * @param  pObj: Pointer to STM32WL_MODEM_Object_t
 * @retval AT_OK if success, otherwise AT_ERROR
 */
AT_resp_code_t AtManageEmpty(STM32WL_MODEM_Object_t *pObj);

/**
 * @brief  Modem delay
 * @param  pObj: Pointer to STM32WL_MODEM_Object_t
 * @param  msDelay: Milliseconds of delay
 * @retval none
 */
static void STM32WL_MODEM_Delay(STM32WL_MODEM_Object_t *pObj, uint32_t msDelay);

/**
 * @brief  Read wrap
 * @param  Handle: Pointer to void
 * @param  pData: Pointer to 8bit unsigned integer
 * @param  Length: 32bit unsigned integer length
 * @retval BSP_ERROR type
 */
static int32_t ReadWrap(void *Handle, uint8_t *pData, uint32_t Length);

/**
 * @brief  Write wrap
 * @param  Handle: Pointer to void
 * @param  pData: Pointer to 8bit unsigned integer
 * @param  Length: 32bit unsigned integer length
 * @retval BSP_ERROR type
 */
static int32_t WriteWrap(void *Handle, const uint8_t *pData, uint32_t Length);

/**
 * @brief  Reset wrap
 * @param  Handle: Pointer to void
 * @param  pData: Pointer to 8bit unsigned integer
 * @param  Length: 32bit unsigned integer length
 * @retval BSP_ERROR type
 */
static int32_t ResetWrap(void *Handle, uint8_t Level);

/**
 * @brief  Get AT command string
 * @param  cmd_code: AT_cmd_code_t
 * @retval command string
 */
static char *Get_AT_cmd_strings(AT_cmd_code_t cmd_code);

/**
 * @brief  Check URCs
 * @param  pObj: Pointer to STM32WL_MODEM_Object_t
 * @param  urcs_timeout: 32bit unsigned integer
 * @param  time_slices: 32bit unsigned integer
 * @retval none
 */
static void checkURCs(STM32WL_MODEM_Object_t *pObj, uint32_t urcs_timeout, uint32_t time_slices);

/**
* @} STM32WL_MODEM_Private_FunctionPrototypes
*/

/** @addtogroup STM32WL_MODEM_FunctionDefinitions STM32WL modem - Function definitions
  * @brief Function definitions
  * @{
  */

/* Function definitions ------------------------------------------------------*/

__WEAK void SendConfirmedCallback(void) {}
__WEAK void JoinedCallback(uint8_t bJoinStatus, uint8_t bJoinComplete) {}
__WEAK void BusyErrorCallback(void) {}
__WEAK void DownlinkMsg(uint32_t nFPort, uint32_t nLen, uint8_t *dlbuf) {}

int32_t STM32WL_MODEM_Init(STM32WL_MODEM_Object_t *pObj)
{
  /* Select default region. */
  pObj->region = STM32WL_MODEM_REGION_EU868;
  pObj->ack_enabled = 0;
  pObj->adr = 0;
  pObj->dr = 4;
  pObj->is_initialized = 1;

