RobertATU/LoRaWAN-Lamb-Link-Next/CustomUC/Src/stm32wl_modem.c
  return STM32WL_MODEM_OK;
}

int32_t STM32WL_MODEM_DeInit(STM32WL_MODEM_Object_t *pObj)
{
  pObj->is_initialized = 0;

  return STM32WL_MODEM_OK;
}

int32_t STM32WL_MODEM_GetCapabilities(STM32WL_MODEM_Object_t *pObj, STM32WL_MODEM_Capabilities_t *Capabilities)
{
  /* Prevent unused argument(s) compilation warning */
  (void)(pObj);

  Capabilities->LoRa            = 1;
  return STM32WL_MODEM_OK;
}

int32_t STM32WL_MODEM_RegisterBusIO(STM32WL_MODEM_Object_t *pObj, STM32WL_MODEM_IO_t *pIO)
{
  int32_t ret = STM32WL_MODEM_OK;

  if (pObj == NULL)
  {
    ret = STM32WL_MODEM_ERROR;
  }
  else
  {
    pObj->IO.Init       = pIO->Init;
    pObj->IO.DeInit     = pIO->DeInit;
    pObj->IO.BusType    = pIO->BusType;
    pObj->IO.Address    = pIO->Address;
    pObj->IO.Write      = pIO->Write;
    pObj->IO.Read       = pIO->Read;
    pObj->IO.Reset       = pIO->Reset;
    pObj->IO.GetTick    = pIO->GetTick;

    pObj->Ctx.read      = ReadWrap;
    pObj->Ctx.write     = WriteWrap;
    pObj->Ctx.handle    = pObj;

    if (pObj->IO.Init == NULL)
    {
      ret = STM32WL_MODEM_ERROR;
    }
    else if (pObj->IO.Init() != STM32WL_MODEM_OK)
    {
      ret = STM32WL_MODEM_ERROR;
    }
    else
    {
      /* Continue configuration, e.g. AT ping */
    }
  }

  return ret;
}

int32_t STM32WL_MODEM_HwReset(STM32WL_MODEM_Object_t *pObj)
{
  int32_t nRet = STM32WL_MODEM_OK;

  PRINTF_0("MODEM_RESET()\r\n");
  ResetWrap(pObj, 0);
  STM32WL_MODEM_Delay(pObj, 10);

  ReadWrap(pObj, wlbuf, WL_RX_BUFFER_LEN);
  ResetWrap(pObj, 1);
  STM32WL_MODEM_Delay(pObj, 100);
  PRINTF_0("WL response: ");
  PRINTF_0((char*)wlbuf);
  STM32WL_MODEM_ManageURCs(pObj);

  if(AtManage(pObj, AT_CTRL, AT_AT, NULL, 0) == AT_OK)
  {
    //go ahead
    PRINTF_0("STM32WL status OK\r\n");
    nRet = STM32WL_MODEM_OK; //OK
  }
  else
  {
    PRINTF_0("STM32WL not responding\r\n");
    nRet = STM32WL_MODEM_ERROR; //ERROR
  }
  return nRet;
}

int32_t STM32WL_MODEM_Ping(STM32WL_MODEM_Object_t *pObj)
{
  int32_t nRet = STM32WL_MODEM_OK;
  if(AtManage(pObj, AT_CTRL, AT_AT, NULL, 0) != AT_OK)
  {
    nRet = STM32WL_MODEM_ERROR;
  }
  else
  {
    nRet = STM32WL_MODEM_OK;
  }
  return nRet;
}

int32_t STM32WL_MODEM_ManageURCs(STM32WL_MODEM_Object_t *pObj)
{
  checkURCs(pObj, URCS_TIMEOUT, N_TIME_SLICES);
  memset(wlbuf, 0x00, WL_RX_BUFFER_LEN);
  return ReadWrap(pObj, wlbuf, WL_RX_BUFFER_LEN);
}

int32_t STM32WL_MODEM_SendBinPacket(STM32WL_MODEM_Object_t *pObj, uint8_t *Buffer, uint32_t DataSize, uint32_t Port, uint8_t Confirmed)
{
  // fw v1.1.0 .help_string = "AT"AT_SEND"=<Port>:<Ack>:<Payload><CR>. Send binary data with the application Port=[1..199] and Ack=[0:unconfirmed, 1:confirmed]\r\n",// e.g. AT+SEND=99:0:020104030605\r
  char tmpStr[10+1];
  //as a memory optimized alternative

  // send +SENDB=
  PRINTF_1("AT+SEND=");
  WriteWrap(pObj, (const uint8_t *)"AT+SEND=", strlen("AT+SEND="));

  // send 99
  snprintf(tmpStr, 10, "%ld", Port);
  PRINTF_1(tmpStr);
  WriteWrap(pObj, (const uint8_t*)tmpStr, strlen(tmpStr));

  // send :
  PRINTF_1(":");
  WriteWrap(pObj, (const uint8_t *)":", strlen(":"));

  // send 0
  snprintf(tmpStr, 10, "%d", Confirmed);
  PRINTF_1(tmpStr);
  WriteWrap(pObj, (const uint8_t*)tmpStr, strlen(tmpStr));

  // send :
  PRINTF_1(":");
  WriteWrap(pObj, (const uint8_t *)":", strlen(":"));

  // for loop, send payload bytes
  for(uint32_t i = 0; i<DataSize; i++)
  {
    snprintf(tmpStr, 10, "%.2X", Buffer[i] );
    PRINTF_1(tmpStr);
    WriteWrap(pObj, (const uint8_t*)tmpStr, strlen(tmpStr));
  }

  // call specific AtManageEmpty, that sends \r and collect the response
  AT_resp_code_t ret = AtManageEmpty(pObj);
  int32_t nRet = 0;

  if(ret == AT_OK)
  {
    PRINTF_1("AtManageEmpty OK\r\n");
    nRet = STM32WL_MODEM_OK;
  }
  else
  {
    PRINTF_1("AtManageEmpty KO\r\n");
    nRet = STM32WL_MODEM_ERROR;
  }

  return nRet;
}

int32_t STM32WL_MODEM_GetVersion(STM32WL_MODEM_Object_t *pObj, STM32WL_MODEM_wlversions_t * ver)
{
  AT_resp_code_t ret = AT_ERROR;
  PRINTF_0("LoRa_GetVersion()\r\n");

  ret = AtManage(pObj, AT_GET, AT_VER, ptr, PTR_BUFFER_LEN);
  if(ret == AT_OK)
  {
    char *token;
    const char s[2] = "\r";

    memset(ver,0x00, sizeof(STM32WL_MODEM_wlversions_t));

    token = strtok((char*)ptr, s);

    while( token != NULL )
    {
      if(token[0] == '\n')
      {
        token++;
      }

      PRINTF_0("%s\r\n", token);

      if(*token != '\0')
      {
        //search "OK" URC
        if(strncmp((char*)token, "OK", strlen("OK")) == 0)
        {
          //    PRINTF_1("- OK - found\r\n");
          break;
        }
        else if(strncmp((char*)token, "APP_VERSION:        V", strlen("APP_VERSION:        V")) == 0)
        {
          //    PRINTF_1("Single core APP_VERSION\r\n");
          ver->m4app.s.major = xdigit(token[21]);
          ver->m4app.s.minor = xdigit(token[23]);
          ver->m4app.s.rev = xdigit(token[25]);
        }
        else if(strncmp((char*)token, "M4 APP_VERSION:     V", strlen("M4 APP_VERSION:     V")) == 0)
        {
          //    PRINTF_1("M4 APP_VERSION\r\n");
          ver->m4app.s.major = xdigit(token[21]);
          ver->m4app.s.minor = xdigit(token[23]);
          ver->m4app.s.rev = xdigit(token[25]);
        }
        else if(strncmp((char*)token, "M0PLUS_APP_VERSION: V", strlen("M0PLUS_APP_VERSION: V")) == 0)
        {
          //    PRINTF_1("M0PLUS_APP_VERSION\r\n");
          ver->m0plusapp.s.major = xdigit(token[21]);
          ver->m0plusapp.s.minor = xdigit(token[23]);
          ver->m0plusapp.s.rev = xdigit(token[25]);
        }
        else if(strncmp((char*)token, "MW_LORAWAN_VERSION: V", strlen("MW_LORAWAN_VERSION: V")) == 0)
        {
          //    PRINTF_1("MW_LORAWAN_VERSION\r\n");
          ver->mwlora.s.major = xdigit(token[21]);
          ver->mwlora.s.minor = xdigit(token[23]);
          ver->mwlora.s.rev = xdigit(token[25]);
        }
        else if(strncmp((char*)token, "MW_RADIO_VERSION:   V", strlen("MW_RADIO_VERSION:   V")) == 0)
        {
          //    PRINTF_1("MW_RADIO_VERSION\r\n");
          ver->mwradio.s.major = xdigit(token[21]);
          ver->mwradio.s.minor = xdigit(token[23]);
          ver->mwradio.s.rev = xdigit(token[25]);
        }
      }

      token = strtok(NULL, s);
    }
  }
  return (ret == AT_OK)?STM32WL_MODEM_OK:STM32WL_MODEM_ERROR;
}

int32_t STM32WL_MODEM_GetDeviceEUI(STM32WL_MODEM_Object_t *pObj, uint8_t *pDevEui)
{
  AT_resp_code_t ret;
  PRINTF_0("LoRa_GetDeviceEUI()\r\n");
  memset(ptr, 0x00, 32);
  ret = AtManage(pObj, AT_GET, AT_DEUI, ptr, 32);
  if(ret == AT_OK)
  {
    PRINTF_0("resp: ");
    PRINTF_0((char*)ptr);

