RobertATU/LoRaWAN-Lamb-Link-Next/CustomUC/Src/stm32wl_modem.c
    uint32_t nVals = sscanf((char*)ptr, "%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx",
    &pDevEui[0], &pDevEui[1], &pDevEui[2], &pDevEui[3],
    &pDevEui[4], &pDevEui[5], &pDevEui[6], &pDevEui[7]);

    if(nVals == 8)
    {
      PRINTF_0("DevEUI = ");
      PRINTF_0("%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X\r\n", pDevEui[0], pDevEui[1], pDevEui[2], pDevEui[3],
                                                                 pDevEui[4], pDevEui[5], pDevEui[6], pDevEui[7]);
    }
    else
    {
      ret = AT_ERROR; //actually not an AT error...
    }
  }
  return (ret == AT_OK)?STM32WL_MODEM_OK:STM32WL_MODEM_ERROR;
}

int32_t STM32WL_MODEM_GetAppEUI(STM32WL_MODEM_Object_t *pObj, uint8_t *pAppEui)
{
  AT_resp_code_t ret;
  PRINTF_0("LoRa_GetAppEUI()\r\n");
  memset(ptr, 0x00, 32);
  ret = AtManage(pObj, AT_GET, AT_APPEUI, ptr, PTR_BUFFER_LEN);
  if(ret == AT_OK)
  {
    PRINTF_0("resp: ");
    PRINTF_0((char*)ptr);

    uint32_t nVals = sscanf((char*)ptr, "%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx",
    &pAppEui[0], &pAppEui[1], &pAppEui[2], &pAppEui[3],
    &pAppEui[4], &pAppEui[5], &pAppEui[6], &pAppEui[7]);

    if(nVals == 8)
    {
      PRINTF_0("AppEUI = ");
      PRINTF_0("%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X\r\n",
                  pAppEui[0], pAppEui[1], pAppEui[2], pAppEui[3],
                  pAppEui[4], pAppEui[5], pAppEui[6], pAppEui[7]);
    }
    else
    {
      ret = AT_ERROR; //actually not an AT error...
    }
  }
  return (ret == AT_OK)?STM32WL_MODEM_OK:STM32WL_MODEM_ERROR;
}

int32_t STM32WL_MODEM_GetAppKEY(STM32WL_MODEM_Object_t *pObj, uint8_t *pAppKey)
{
  AT_resp_code_t ret;
  PRINTF_0("LoRa_GetAppKEY()\r\n");
  memset(ptr, 0x00, PTR_BUFFER_LEN);
  ret = AtManage(pObj, AT_GET, AT_APPKEY, ptr, PTR_BUFFER_LEN);
  if(ret == AT_OK)
  {
    PRINTF_0("resp: ");
    PRINTF_0((char*)ptr);

    uint32_t nVals = sscanf((char*)ptr, "%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx",
    &pAppKey[0], &pAppKey[1], &pAppKey[2], &pAppKey[3],
    &pAppKey[4], &pAppKey[5], &pAppKey[6], &pAppKey[7],
    &pAppKey[8], &pAppKey[9], &pAppKey[10], &pAppKey[11],
    &pAppKey[12], &pAppKey[13], &pAppKey[14], &pAppKey[15]);

    if(nVals == 16)
    {
      PRINTF_0("AppKEY = ");
      PRINTF_0("%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X\r\n",
                  pAppKey[0], pAppKey[1], pAppKey[2], pAppKey[3],
                  pAppKey[4], pAppKey[5], pAppKey[6], pAppKey[7],
                  pAppKey[8], pAppKey[9], pAppKey[10], pAppKey[11],
                  pAppKey[12], pAppKey[13], pAppKey[14], pAppKey[15]);
    }
    else
    {
      ret = AT_ERROR; //actually not an AT error...
    }
  }
  return (ret == AT_OK)?STM32WL_MODEM_OK:STM32WL_MODEM_ERROR;
}

int32_t STM32WL_MODEM_GetNwkKEY(STM32WL_MODEM_Object_t *pObj, uint8_t *pNwkKey)
{
  AT_resp_code_t ret;
  PRINTF_0("LoRa_GetNwkKEY()\r\n");
  memset(ptr, 0x00, PTR_BUFFER_LEN);
  ret = AtManage(pObj, AT_GET, AT_NWKKEY, ptr, PTR_BUFFER_LEN);
  if(ret == AT_OK)
  {
    PRINTF_0("resp: ");
    PRINTF_0((char*)ptr);

    uint32_t nVals = sscanf((char*)ptr, "%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx",
    &pNwkKey[0], &pNwkKey[1], &pNwkKey[2], &pNwkKey[3],
    &pNwkKey[4], &pNwkKey[5], &pNwkKey[6], &pNwkKey[7],
    &pNwkKey[8], &pNwkKey[9], &pNwkKey[10], &pNwkKey[11],
    &pNwkKey[12], &pNwkKey[13], &pNwkKey[14], &pNwkKey[15]);

    if(nVals == 16)
    {
      PRINTF_0("NwkKEY = ");
      PRINTF_0("%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X\r\n",
                  pNwkKey[0], pNwkKey[1], pNwkKey[2], pNwkKey[3],
                  pNwkKey[4], pNwkKey[5], pNwkKey[6], pNwkKey[7],
                  pNwkKey[8], pNwkKey[9], pNwkKey[10], pNwkKey[11],
                  pNwkKey[12], pNwkKey[13], pNwkKey[14], pNwkKey[15]);
    }
    else
    {
      ret = AT_ERROR; //actually not an AT error...
    }
  }
  return (ret == AT_OK)?STM32WL_MODEM_OK:STM32WL_MODEM_ERROR;
}

int32_t STM32WL_MODEM_SetAppEUI(STM32WL_MODEM_Object_t *pObj, uint8_t *NewAppEui)
{
  AT_resp_code_t ret;
  PRINTF_0("LoRa_SetAppEUI()\r\n");
  sprintf((char*)ptr, "%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X",
          NewAppEui[0], NewAppEui[1], NewAppEui[2], NewAppEui[3],
          NewAppEui[4], NewAppEui[5], NewAppEui[6], NewAppEui[7]);

  ret = AtManage(pObj, AT_SET, AT_APPEUI, ptr, PTR_BUFFER_LEN);

  return (ret == AT_OK)?STM32WL_MODEM_OK:STM32WL_MODEM_ERROR;
}

int32_t STM32WL_MODEM_SetAppKEY(STM32WL_MODEM_Object_t *pObj, uint8_t *NewAppKey)
{
  AT_resp_code_t ret;
  PRINTF_0("LoRa_SetAppKEY()\r\n");
  sprintf((char*)ptr, "%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X",
                  NewAppKey[0], NewAppKey[1], NewAppKey[2], NewAppKey[3],
                  NewAppKey[4], NewAppKey[5], NewAppKey[6], NewAppKey[7],
                  NewAppKey[8], NewAppKey[9], NewAppKey[10], NewAppKey[11],
                  NewAppKey[12], NewAppKey[13], NewAppKey[14], NewAppKey[15]);

  ret = AtManage(pObj, AT_SET, AT_APPKEY, ptr, PTR_BUFFER_LEN);

  return (ret == AT_OK)?STM32WL_MODEM_OK:STM32WL_MODEM_ERROR;
}

int32_t STM32WL_MODEM_SetNwkKEY(STM32WL_MODEM_Object_t *pObj, uint8_t *NewNwkKey)
{
  AT_resp_code_t ret;
  PRINTF_0("LoRa_SetNwkKEY()\r\n");
  sprintf((char*)ptr, "%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X",
                  NewNwkKey[0], NewNwkKey[1], NewNwkKey[2], NewNwkKey[3],
                  NewNwkKey[4], NewNwkKey[5], NewNwkKey[6], NewNwkKey[7],
                  NewNwkKey[8], NewNwkKey[9], NewNwkKey[10], NewNwkKey[11],
                  NewNwkKey[12], NewNwkKey[13], NewNwkKey[14], NewNwkKey[15]);

  ret = AtManage(pObj, AT_SET, AT_NWKKEY, ptr, PTR_BUFFER_LEN);

  return (ret == AT_OK)?STM32WL_MODEM_OK:STM32WL_MODEM_ERROR;
}




int32_t STM32WL_MODEM_GetDADD(STM32WL_MODEM_Object_t *pObj, uint32_t *pDAddress)
{
  AT_resp_code_t ret;
  PRINTF_0("LoRa_GetDevAddress()\r\n");
  memset(ptr, 0x00, PTR_BUFFER_LEN);
  ret = AtManage(pObj, AT_GET, AT_DADDR, ptr, PTR_BUFFER_LEN);
  if(ret == AT_OK)
  {
    PRINTF_0("resp: ");
    PRINTF_0((char*)ptr);

    uint32_t nVals = sscanf((char*)ptr, "%hhx:%hhx:%hhx:%hhx",
                     &((unsigned char *)(pDAddress))[3],
                     &((unsigned char *)(pDAddress))[2],
                     &((unsigned char *)(pDAddress))[1],
                     &((unsigned char *)(pDAddress))[0]);

    if(nVals == 4)
    {
      PRINTF_0("DevAddress = ");
      PRINTF_0("%02X:%02X:%02X:%02X\r\n",
            ( unsigned )( ( unsigned char * )( &pDAddress ) )[3],
            ( unsigned )( ( unsigned char * )( &pDAddress ) )[2],
            ( unsigned )( ( unsigned char * )( &pDAddress ) )[1],
            ( unsigned )( ( unsigned char * )( &pDAddress ) )[0] );
    }
    else
    {
      ret = AT_ERROR; //actually not an AT error...
    }
  }
  return (ret == AT_OK)?STM32WL_MODEM_OK:STM32WL_MODEM_ERROR;
}

int32_t STM32WL_MODEM_GetAppSKEY(STM32WL_MODEM_Object_t *pObj, uint8_t *pAppSKey)
{
  AT_resp_code_t ret;
  PRINTF_0("LoRa_GetAppSKEY()\r\n");
  memset(ptr, 0x00, PTR_BUFFER_LEN);
  ret = AtManage(pObj, AT_GET, AT_APPSKEY, ptr, PTR_BUFFER_LEN);
  if(ret == AT_OK)
  {
    PRINTF_0("resp: ");
    PRINTF_0((char*)ptr);

