RobertATU/LoRaWAN-Lamb-Link-Next/CustomUC/Src/stm32wl_modem.c
    uint32_t nVals = sscanf((char*)ptr, "%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx",
    &pAppSKey[0], &pAppSKey[1], &pAppSKey[2], &pAppSKey[3],
    &pAppSKey[4], &pAppSKey[5], &pAppSKey[6], &pAppSKey[7],
    &pAppSKey[8], &pAppSKey[9], &pAppSKey[10], &pAppSKey[11],
    &pAppSKey[12], &pAppSKey[13], &pAppSKey[14], &pAppSKey[15]);

    if(nVals == 16)
    {
      PRINTF_0("AppSKEY = ");
      PRINTF_0("%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X\r\n",
                  pAppSKey[0], pAppSKey[1], pAppSKey[2], pAppSKey[3],
                  pAppSKey[4], pAppSKey[5], pAppSKey[6], pAppSKey[7],
                  pAppSKey[8], pAppSKey[9], pAppSKey[10], pAppSKey[11],
                  pAppSKey[12], pAppSKey[13], pAppSKey[14], pAppSKey[15]);
    }
    else
    {
      ret = AT_ERROR; //actually not an AT error...
    }
  }
  return (ret == AT_OK)?STM32WL_MODEM_OK:STM32WL_MODEM_ERROR;
}

int32_t STM32WL_MODEM_GetNwkSKEY(STM32WL_MODEM_Object_t *pObj, uint8_t *pNwkSKey)
{
  AT_resp_code_t ret;
  PRINTF_0("LoRa_GetNwkSKEY()\r\n");
  memset(ptr, 0x00, PTR_BUFFER_LEN);
  ret = AtManage(pObj, AT_GET, AT_NWKSKEY, ptr, PTR_BUFFER_LEN);
  if(ret == AT_OK)
  {
    PRINTF_0("resp: ");
    PRINTF_0((char*)ptr);

    uint32_t nVals = sscanf((char*)ptr, "%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx:%hhx",
    &pNwkSKey[0], &pNwkSKey[1], &pNwkSKey[2], &pNwkSKey[3],
    &pNwkSKey[4], &pNwkSKey[5], &pNwkSKey[6], &pNwkSKey[7],
    &pNwkSKey[8], &pNwkSKey[9], &pNwkSKey[10], &pNwkSKey[11],
    &pNwkSKey[12], &pNwkSKey[13], &pNwkSKey[14], &pNwkSKey[15]);

    if(nVals == 16)
    {
      PRINTF_0("NwkKEY = ");
      PRINTF_0("%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X\r\n",
                  pNwkSKey[0], pNwkSKey[1], pNwkSKey[2], pNwkSKey[3],
                  pNwkSKey[4], pNwkSKey[5], pNwkSKey[6], pNwkSKey[7],
                  pNwkSKey[8], pNwkSKey[9], pNwkSKey[10], pNwkSKey[11],
                  pNwkSKey[12], pNwkSKey[13], pNwkSKey[14], pNwkSKey[15]);
    }
    else
    {
      ret = AT_ERROR; //actually not an AT error...
    }
  }
  return (ret == AT_OK)?STM32WL_MODEM_OK:STM32WL_MODEM_ERROR;
}

int32_t STM32WL_MODEM_SetDADD(STM32WL_MODEM_Object_t *pObj, uint32_t NewDAddress)
{
  AT_resp_code_t ret;
  PRINTF_0("LoRa_SetDevAddress()\r\n");
  sprintf((char*)ptr, "%02X:%02X:%02X:%02X\r\n",
            (unsigned)((unsigned char *)(&NewDAddress))[3],
            (unsigned)((unsigned char *)(&NewDAddress))[2],
            (unsigned)((unsigned char *)(&NewDAddress))[1],
            (unsigned)((unsigned char *)(&NewDAddress))[0]);

  ret = AtManage(pObj, AT_SET, AT_DADDR, ptr, PTR_BUFFER_LEN);

  return (ret == AT_OK)?STM32WL_MODEM_OK:STM32WL_MODEM_ERROR;
}

int32_t STM32WL_MODEM_SetAppSKEY(STM32WL_MODEM_Object_t *pObj, uint8_t *NewAppSKey)
{
  AT_resp_code_t ret;
  PRINTF_0("LoRa_SetAppSKEY()\r\n");
  sprintf((char*)ptr, "%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X",
                  NewAppSKey[0], NewAppSKey[1], NewAppSKey[2], NewAppSKey[3],
                  NewAppSKey[4], NewAppSKey[5], NewAppSKey[6], NewAppSKey[7],
                  NewAppSKey[8], NewAppSKey[9], NewAppSKey[10], NewAppSKey[11],
                  NewAppSKey[12], NewAppSKey[13], NewAppSKey[14], NewAppSKey[15]);

  ret = AtManage(pObj, AT_SET, AT_APPSKEY, ptr, PTR_BUFFER_LEN);

  return (ret == AT_OK)?STM32WL_MODEM_OK:STM32WL_MODEM_ERROR;
}

int32_t STM32WL_MODEM_SetNwkSKEY(STM32WL_MODEM_Object_t *pObj, uint8_t *NewNwkSKey)
{
  AT_resp_code_t ret;
  PRINTF_0("LoRa_SetNwkSKEY()\r\n");
  sprintf((char*)ptr, "%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X:%.2X",
                  NewNwkSKey[0], NewNwkSKey[1], NewNwkSKey[2], NewNwkSKey[3],
                  NewNwkSKey[4], NewNwkSKey[5], NewNwkSKey[6], NewNwkSKey[7],
                  NewNwkSKey[8], NewNwkSKey[9], NewNwkSKey[10], NewNwkSKey[11],
                  NewNwkSKey[12], NewNwkSKey[13], NewNwkSKey[14], NewNwkSKey[15]);

  ret = AtManage(pObj, AT_SET, AT_NWKSKEY, ptr, PTR_BUFFER_LEN);

  return (ret == AT_OK)?STM32WL_MODEM_OK:STM32WL_MODEM_ERROR;
}






int32_t STM32WL_MODEM_GetDataRate(STM32WL_MODEM_Object_t *pObj, uint8_t *pnLoraDr)
{
  AT_resp_code_t ret = AT_ERROR;
  PRINTF_0("Lora_GetDataRate()\r\n");
  memset(ptr, 0x00, PTR_BUFFER_LEN);
  ret = AtManage(pObj, AT_GET, AT_DR, ptr, PTR_BUFFER_LEN);
  if(ret == AT_OK)
  {
    PRINTF_0("resp: ");
    PRINTF_0((char*)ptr);
    uint8_t nDr;
    uint32_t nVals = sscanf((char*)ptr, "%hhx", &nDr);

    if(nVals == 1)
    {
      PRINTF_0("GET DR = %.2X", nDr);
      *pnLoraDr = nDr;
    }
    else
    {
      ret = AT_ERROR; //actually not an AT error...
    }
  }
  return (ret == AT_OK)?STM32WL_MODEM_OK:STM32WL_MODEM_ERROR;
}

int32_t STM32WL_MODEM_SetRegionBandID(STM32WL_MODEM_Object_t *pObj, STM32WL_MODEM_region_t *region)
{
  AT_resp_code_t ret;
  PRINTF_0("Lora_SetRegionBandID()\r\n");
  uint32_t b = (uint32_t)(*region);
  sprintf((char*)ptr, "%ld", b);

  ret = AtManage(pObj, AT_SET, AT_BAND, ptr, PTR_BUFFER_LEN);

  return (ret == AT_OK)?STM32WL_MODEM_OK:STM32WL_MODEM_ERROR;
}

int32_t STM32WL_MODEM_Join_OTAA(STM32WL_MODEM_Object_t *pObj)
{
  AT_resp_code_t ret;
  PRINTF_0("LoRa_Join_OTAA()\r\n");
  sprintf((char*)ptr, "%d", 1);

  ret = AtManage(pObj, AT_SET, AT_JOIN, ptr, PTR_BUFFER_LEN);

  return (ret == AT_OK)?STM32WL_MODEM_OK:STM32WL_MODEM_ERROR;
}

int32_t STM32WL_MODEM_Join_ABP(STM32WL_MODEM_Object_t *pObj)
{
  AT_resp_code_t ret;
  PRINTF_0("LoRa_Join_OTAA()\r\n");
  sprintf((char*)ptr, "%d", 0);

  ret = AtManage(pObj, AT_SET, AT_JOIN, ptr, PTR_BUFFER_LEN);

  return (ret == AT_OK)?STM32WL_MODEM_OK:STM32WL_MODEM_ERROR;
}

int32_t STM32WL_MODEM_SetAdaptiveDataRate(STM32WL_MODEM_Object_t *pObj, uint8_t adr)
{
  AT_resp_code_t ret;
  PRINTF_0("Lora_SetAdaptiveDataRate()\r\n");
  sprintf((char*)ptr, "%d", adr);

  ret = AtManage(pObj, AT_SET, AT_ADR, ptr, PTR_BUFFER_LEN);

