RobertATU/LoRaWAN-Lamb-Link-Next/CustomUC/Src/stm32wl_modem.c
  return (ret == AT_OK)?STM32WL_MODEM_OK:STM32WL_MODEM_ERROR;
}

int32_t STM32WL_MODEM_SetDataRate(STM32WL_MODEM_Object_t *pObj, uint8_t dr)
{
  AT_resp_code_t ret;
  PRINTF_0("Lora_SetDataRate()\r\n");
  sprintf((char*)ptr, "%d", dr);

  ret = AtManage(pObj, AT_SET, AT_DR, ptr, PTR_BUFFER_LEN);

  return (ret == AT_OK)?STM32WL_MODEM_OK:STM32WL_MODEM_ERROR;
}

int32_t STM32WL_MODEM_WL_LowPower(STM32WL_MODEM_Object_t *pObj)
{
  return (AtManage(pObj, AT_CTRL, AT_CUST_LP, NULL, 0) == AT_OK)?STM32WL_MODEM_OK:STM32WL_MODEM_ERROR;
}

int32_t STM32WL_MODEM_WL_RebootDfu(STM32WL_MODEM_Object_t *pObj)
{
  return (AtManage(pObj, AT_CTRL, AT_CUST_DFU, NULL, 0) == AT_OK)?STM32WL_MODEM_OK:STM32WL_MODEM_ERROR;
}

int32_t STM32WL_MODEM_Enable(STM32WL_MODEM_Object_t *pObj)
{
  int32_t ret = STM32WL_MODEM_OK;

  return ret;
}

int32_t STM32WL_MODEM_Disable(STM32WL_MODEM_Object_t *pObj)
{
  int32_t ret = STM32WL_MODEM_OK;

  return ret;
}

static int32_t ReadWrap(void *Handle, uint8_t *pData, uint32_t Length)
{
  STM32WL_MODEM_Object_t *pObj = (STM32WL_MODEM_Object_t *)Handle;

  return pObj->IO.Read(pData, Length);
}

static int32_t WriteWrap(void *Handle, const uint8_t *pData, uint32_t Length)
{
  STM32WL_MODEM_Object_t *pObj = (STM32WL_MODEM_Object_t *)Handle;

  return pObj->IO.Write(pData, Length);
}

static int32_t ResetWrap(void *Handle, uint8_t Level)
{
  STM32WL_MODEM_Object_t *pObj = (STM32WL_MODEM_Object_t *)Handle;

  return pObj->IO.Reset(Level);
}

char const AT_resp_OK[] = "\r\nOK\r\n";
char const *AT_resp_strings[] = {
  "\r\nOK\r",
};

static uint8_t bOkFound = 0;
static uint8_t bErrorFound = 0;

void DecodeRxSlotMsg(char*evtstring)
{
  PRINTF_1(evtstring);
  PRINTF_1("\r\n");
}

void DecodeDowlinkMsg(char*evtstring)
{
  int32_t nFPort=0, nLen=0;
  uint8_t nParams = sscanf(evtstring, "+EVT:%ld:%ld:", &nFPort, &nLen);
  if(nParams == 2)
  {
    uint8_t i, nSymbols=0;
    for(i=0;i<15;i++)//+EVT:255:255: max len = 13
    {
      if(evtstring[i] == ':')
      {
        nSymbols++;
      }
      if(nSymbols==3)
      {
        break;
      }
    }
    i++;
    uint8_t downlinkbuf[256]= { 0 };
    uint32_t j;
    for(j=0;j<nLen;j++)
    {
      char*todecode = &evtstring[i+(j*2)];
      if(isxdigit(todecode[0]) && isxdigit(todecode[1]))
      {
        downlinkbuf[j] = xdigit(todecode[0]);
        downlinkbuf[j] = downlinkbuf[j] << 4;
        downlinkbuf[j] |= xdigit(todecode[1]);
      }
    }
    if(j==nLen)//parse complete
    {
      DownlinkMsg(nFPort, nLen, downlinkbuf);
    }
    //execute downlink callback
  }
}

void ParseToken(char *_token)
{
  //search "+EVT:JOINED" URC
  if(strncmp((char*)_token, "+EVT:JOINED", strlen("+EVT:JOINED")) == 0)
  {
    PRINTF_1("Network has joined!v1.1.0\r\n");
    //execute JOINED callback
    JoinedCallback(1, 1);
  }

  //search "+EVT:JOIN FAILED" URC
  else if(strncmp((char*)_token, "+EVT:JOIN FAILED", strlen("+EVT:JOIN FAILED")) == 0)
  {
    PRINTF_1("Network has NOT joined!v1.1.0\r\n");
    //execute JOINED callback
    JoinedCallback(0, 1);
  }

  //search "JOINED" URC
  else if(strncmp((char*)_token, "JOINED", strlen("JOINED")) == 0)
  {
    PRINTF_1("Network has joined!v0.6.0\r\n");
    //execute JOINED callback
    JoinedCallback(1, 1);
  }

  //+EVT:SEND_CONFIRMED
  else if(strncmp((char*)_token, "+EVT:SEND_CONFIRMED", strlen("+EVT:SEND_CONFIRMED")) == 0)
  {
    PRINTF_1("Ack received!\r\n");
    //execute SEND_CONFIRMED callback
    SendConfirmedCallback();
  }

  //+EVT:RX_ RX_<slot>:<DR>:<RSSI>:<SNR> or RX_<slot>:<DR>:<RSSI>:<SNR>:<DMODM>:<GWN>
  else if(strncmp((char*)_token, "+EVT:RX_", strlen("+EVT:RX_")) == 0)
  {
    PRINTF_1("EVT:RX_\r\n");
    //execute EVT:RX_ callback
    DecodeRxSlotMsg(_token);
  }

  //+EVT: downlink msg, +EVT:<port>:<size>:<payload> e.g. +EVT:1:04:ababcdcd fport 1, size 4 bytes, payload
  else if(strncmp((char*)_token, "+EVT:", strlen("+EVT:")) == 0)
  {
    PRINTF_1("Downlink message\r\n");
    DecodeDowlinkMsg(_token);
  }

  //search "AT_NO_NETWORK_JOINED" URC
  else if(strncmp((char*)_token, "AT_NO_NETWORK_JOINED", strlen("AT_NO_NETWORK_JOINED")) == 0)
  {
    PRINTF_1("- AT_NO_NETWORK_JOINED - found\r\n");
    //execute AT_NO_NETWORK_JOINED callback
    JoinedCallback(0, 0);
  }

  //search "AT_BUSY_ERROR" URC
  else if(strncmp((char*)_token, "AT_BUSY_ERROR", strlen("AT_BUSY_ERROR")) == 0)
  {
    PRINTF_1("- AT_BUSY_ERROR - found\r\n");
    //execute AT_BUSY_ERROR callback
    BusyErrorCallback();
  }
  else
  {
    uint32_t i = 0;
    if(isdigit(_token[0+i]) && _token[1+i] == 's' && isdigit(_token[2+i]) && isdigit(_token[3+i]) && isdigit(_token[4+i]) && _token[5+i] == ':')
    {
      PRINTF_1("\r\nVERB URC:", _token);
    }
    else
    {
      i++;
      if(isdigit(_token[0+i]) && _token[1+i] == 's' && isdigit(_token[2+i]) && isdigit(_token[3+i]) && isdigit(_token[4+i]) && _token[5+i] == ':')
      {
        PRINTF_1("\r\nVERB URC:", _token);
      }
      else
      {
        i++;
        if(isdigit(_token[0+i]) && _token[1+i] == 's' && isdigit(_token[2+i]) && isdigit(_token[3+i]) && isdigit(_token[4+i]) && _token[5+i] == ':')
        {
          PRINTF_1("\r\nVERB URC:", _token);
        }
        else
        {
          i++;
          if(isdigit(_token[0+i]) && _token[1+i] == 's' && isdigit(_token[2+i]) && isdigit(_token[3+i]) && isdigit(_token[4+i]) && _token[5+i] == ':')
          {
            PRINTF_1("\r\nVERB URC:", _token);
          }
          else
          {
            i++;
            if(isdigit(_token[0+i]) && _token[1+i] == 's' && isdigit(_token[2+i]) && isdigit(_token[3+i]) && isdigit(_token[4+i]) && _token[5+i] == ':')
            {
              PRINTF_1("\r\nVERB URC:", _token);
            }
            else
            {
              i++;
              if(isdigit(_token[0+i]) && _token[1+i] == 's' && isdigit(_token[2+i]) && isdigit(_token[3+i]) && isdigit(_token[4+i]) && _token[5+i] == ':')
              {
                PRINTF_1("\r\nVERB URC:", _token);
              }
              else
              {
                PRINTF_1("URC NOT RECOGNIZED\r\n");
              }
            }
          }
        }
      }
    }
    PRINTF_1("%s\r\n", _token);
  }
}

void OkFoundCallback()
{
  bOkFound = 1;
}

void ErrorFoundCallback()
{
  bErrorFound = 1;
}

