RobertATU/LoRaWAN-Lamb-Link-Next/CustomUC/Src/stm32wl_modem.c
void checkURCs(STM32WL_MODEM_Object_t *pObj, uint32_t urcs_timeout, uint32_t time_slices)
{
  uint32_t nIndex = time_slices;
  uint32_t nPreviousLenght = 0;
  uint32_t nCurrentLenght = 0;

  bOkFound = 0;
  bErrorFound = 0;

  PRINTF_0("checkURCs\r\n");

  while(nIndex--)
  {
    if(wlbuf[0] != '\0')
    {
      nCurrentLenght = strlen((char*)wlbuf);
      if(nCurrentLenght == nPreviousLenght)break; // check that no data is flowing
      nPreviousLenght = nCurrentLenght;
    }
    else
    {
      PRINTF_0("NO URCs\r\n");
      break;
    }
    STM32WL_MODEM_Delay(pObj, urcs_timeout/time_slices);
  }

  if(wlbuf[0] != '\0')
  {
    PRINTF_0("\r\nGOT URC\r\n");
    PRINTF_0((char*)wlbuf);

    /* here the unprocessed data must be analysed or at list saved, otherwise info will be lost */
    const char s[2] = "\r";
    char *token;

    /* get the first token */
    token = strtok((char*)wlbuf, s);

    /* walk through other tokens */
    while( token != NULL )
    {
      if(token[0] == '\n')
      {
        token++;
      }

      PRINTF_0("%s\r\n", token);

      if(*token != '\0')
      {
        //search "OK" string
        if(strncmp((char*)token, "OK", strlen("OK")) == 0)
        {
//          PRINTF_1("\r\n- OK - found\r\n");
          //execute OK callback
          OkFoundCallback();
        }
        //search "AT_ERROR" string
        else if(strncmp((char*)token, "AT_ERROR", strlen("AT_ERROR")) == 0)
        {
          PRINTF_1("\r\n- AT_ERROR - found\r\n");
          //execute ERROR callback
          ErrorFoundCallback();
        }
        else
        {
          ParseToken(token);
        }
      }

      token = strtok(NULL, s);
    }
  }
}

void AtWaitResponse(STM32WL_MODEM_Object_t *pObj, uint32_t nTimeout, uint32_t time_slices)
{
  uint32_t nIndex = time_slices;

  uint32_t nPreviousLenght = 0;
  uint32_t nCurrentLenght = 0;
  while(nIndex--)
  {
    if(wlbuf[0] != '\0')
    {
      nCurrentLenght = strlen((char*)wlbuf);
      if(nCurrentLenght == nPreviousLenght)break; // check that no data is flowing
      nPreviousLenght = nCurrentLenght;
    }
    STM32WL_MODEM_Delay(pObj, nTimeout/time_slices);
  }
  if(nIndex != 0xFFFFFFFF)
  {
    PRINTF_0("GOT response\r\n");
    PRINTF_0((char*)wlbuf);
  }
}

AT_resp_code_t AtDecodeResponse(STM32WL_MODEM_Object_t *pObj, AT_cmd_type_t cmd_type, AT_cmd_code_t cmd_code, uint8_t* buftodecode)
{
  AT_resp_code_t nretCode = AT_ERROR;
  uint32_t nBufToDecLen;
  uint32_t nRespOKLen;
  uint32_t nOffset;

  switch(cmd_code)
  {
    //the following commands will have a response that must be decoded (if AT_GET is used)
  case AT_AT:
  case AT_JOIN:
  case AT_NJS:
  case AT_DEUI:
  case AT_DADDR:
  case AT_APPKEY:
  case AT_NWKKEY:
  case AT_NWKSKEY:
  case AT_APPSKEY:
  case AT_APPEUI:
  case AT_SENDB:
  case AT_BAND:
  case AT_ADR:
  case AT_DR:
  case AT_VER:
  case AT_CUST_LP:
  case AT_CUST_DFU:
    nBufToDecLen = strlen((char*)buftodecode);
    nRespOKLen = strlen(AT_resp_OK);
    nOffset = nBufToDecLen - nRespOKLen;
    if(cmd_type != AT_GET)
    {
      checkURCs(pObj, URCS_TIMEOUT, N_TIME_SLICES);
      if(bOkFound)
      {
        nretCode = AT_OK;
      }
      if(bErrorFound)
      {
        nretCode = AT_ERROR;
      }
    }
    else
    {
      if(0==strncmp(AT_resp_OK, (char*)(buftodecode+nOffset), strlen(AT_resp_OK)))
      {
        nretCode = AT_OK;
      }
    }
    break;
  default:
    break;
  }
  return nretCode;
}

AT_resp_code_t AtManage(STM32WL_MODEM_Object_t *pObj, AT_cmd_type_t cmd_type, AT_cmd_code_t cmd_code, void *pInOutData, uint32_t nDataLen)
{
  checkURCs(pObj, URCS_TIMEOUT, N_TIME_SLICES);
  memset(wlbuf, 0x00, WL_RX_BUFFER_LEN);
  ReadWrap(pObj, wlbuf, WL_RX_BUFFER_LEN);

  PRINTF_0("Send AT cmd: AT%s", Get_AT_cmd_strings(cmd_code));
  WriteWrap(pObj, (uint8_t *)"AT", strlen("AT"));
  WriteWrap(pObj, (uint8_t *)Get_AT_cmd_strings(cmd_code), strlen(Get_AT_cmd_strings(cmd_code)));
  if(cmd_type == AT_CTRL)
  {
  }
  else if(cmd_type == AT_SET)
  {
    PRINTF_0("=");
    WriteWrap(pObj, (uint8_t *)"=", strlen("="));
    PRINTF_0(pInOutData);
    WriteWrap(pObj, pInOutData, strlen(pInOutData));
  }
  else if(cmd_type == AT_GET)
  {
    PRINTF_0("=?");
    WriteWrap(pObj, (uint8_t *)"=?", strlen("=?"));
  }
  else if(cmd_type == AT_TEST)
  {
  }
  PRINTF_0("\r\n");
  WriteWrap(pObj, (uint8_t *)"\r", strlen("\r"));
  AtWaitResponse(pObj, AT_WAIT_RESP_TIMEOUT, N_TIME_SLICES);
  AT_resp_code_t ret = AtDecodeResponse(pObj, cmd_type, cmd_code, wlbuf);
  if(ret == AT_OK)
  {
    if(cmd_type == AT_GET)
    {
      memcpy(pInOutData, wlbuf, nDataLen);
    }
  }
  /* restart receiving, not to miss URCs */
  memset(wlbuf, 0x00, WL_RX_BUFFER_LEN);
  ReadWrap(pObj, wlbuf, WL_RX_BUFFER_LEN);

  return ret;
}

AT_resp_code_t AtManageEmpty(STM32WL_MODEM_Object_t *pObj)
{
  checkURCs(pObj, URCS_TIMEOUT, N_TIME_SLICES);
  memset(wlbuf, 0x00, WL_RX_BUFFER_LEN);
  ReadWrap(pObj, wlbuf, WL_RX_BUFFER_LEN);

  PRINTF_0("\r\n");
  WriteWrap(pObj, (uint8_t *)"\r", strlen("\r"));
  AtWaitResponse(pObj, AT_WAIT_RESP_TIMEOUT, N_TIME_SLICES);
  AT_resp_code_t ret = AtDecodeResponse(pObj, AT_SET, AT_AT, wlbuf); // TDODO:FS: check; Decode response like for a generic AT cmd
  if(ret == AT_OK)
  {

  }
  /* restart receiving, not to miss URCs */
  memset(wlbuf, 0x00, WL_RX_BUFFER_LEN);
  ReadWrap(pObj, wlbuf, WL_RX_BUFFER_LEN);

  return ret;
}

static void STM32WL_MODEM_Delay(STM32WL_MODEM_Object_t *pObj, uint32_t msDelay)
{
  uint32_t tickstart = pObj->IO.GetTick();

  while((pObj->IO.GetTick() - tickstart) < msDelay)
  {
  }
}

char *Get_AT_cmd_strings(AT_cmd_code_t cmd_code)
{
  //1. search atcmd_stm32wl_custom.c/.h

  //2. if not found, search AT_cmd_strings

  return AT_cmd_strings[cmd_code].cmdstring;
}

/**
* @} STM32WL_MODEM_FunctionDefinitions
*/

/**
  * @} ASTRA_BSP_MODEM
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
